ams/src/DataProcessors/AMS_ЗаказыКлиентовНаВ2В/AMS_ЗаказыКлиентовНаВ2В.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AMS_ЗаказыКлиентовНаВ2В</name>
  <attributes>
    <name>ТокенАвторизации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Id</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСоздания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОбновления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартнерКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПартнерИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказКлиента</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостоянияДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Клиенты</name>
    <attributes>
      <name>code1c</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаДоступа</name>
      <type>
        <types>CatalogRef.ГруппыДоступаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоПродаж</name>
      <type>
        <types>CatalogRef.AMS_ПравилаПродаж</types>
      </type>
    </attributes>
    <attributes>
      <name>Соглашение</name>
      <type>
        <types>CatalogRef.СоглашенияСКлиентами</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Id</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>company</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>manager</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>fullName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>creationTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>accessTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>phone</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>email</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>isChecked</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>countOrders</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>amountOrders</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ams/src/Enums/AMS_СтатусыВ2В/AMS_СтатусыВ2В.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_СтатусыВ2В</name>
  <enumValues>
    <name>pending</name>
  </enumValues>
  <enumValues>
    <name>processing</name>
  </enumValues>
  <enumValues>
    <name>reserveChanged</name>
  </enumValues>
  <enumValues>
    <name>reserveNotChanged</name>
  </enumValues>
  <enumValues>
    <name>confirmedClient</name>
  </enumValues>
  <enumValues>
    <name>packed</name>
  </enumValues>
  <enumValues>
    <name>readyTogo</name>
  </enumValues>
  <enumValues>
    <name>shipped</name>
  </enumValues>
  <enumValues>
    <name>closed</name>
  </enumValues>
  <enumValues>
    <name>canceled</name>
  </enumValues>
</mdclass:Enum>

ams/src/DataProcessors/AMS_ЗаказыКлиентовНаВ2В/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ТокенАвторизации = AMS_Сервер.ПолучитьТокенАвторизации(Пользователи.АвторизованныйПользователь());
	
	Если Пользователи.РолиДоступны("AMS_Аналитик") Тогда
		Элементы.КлиентыВыгрузитьЦеныВсемКлиентам.Видимость = Истина;
		
		НаборЗаписей = РегистрыСведений.AMS_МенеджерыВ2В.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		ЗначениеВРеквизитФормы(НаборЗаписей, "Менеджеры");
		
	Иначе
		Элементы.КлиентыВыгрузитьЦеныВсемКлиентам.Видимость = Ложь;
		Элементы.СтраницаПользователиВ2В.Видимость = Ложь;;
	КонецЕсли;
	
	Элементы.ЗаказыСтатус_ВОжидании.Видимость  = AMS_ВызовСервера.ЭтоKhors();

	ЗаполнитьСписокЗаказов();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_ЗаказКлиента" Тогда
		ЗаполнитьСписокЗаказов();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.СтраницаЗаказы Тогда
		ЗаполнитьСписокЗаказов();

	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаКлиенты Тогда
		Если Объект.Клиенты.Количество() = 0 Тогда
			ЗаполнитьСписокКлиентов();
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаЦены Тогда
		СформироватьПрайсЛистКлиентаВ2В(ПолучитьДанныеКлиентаДляПрайса());
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗаказы

&НаКлиенте
Процедура ЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Заказы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаказКлиента = ТекущиеДанные.ЗаказКлиента;
	
	Если ЗначениеЗаполнено(ЗаказКлиента) Тогда
		ПоказатьЗначение(, ЗаказКлиента);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКлиенты

&НаКлиенте
Процедура КлиентыПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		Партнер = ТекущиеДанные.Партнер;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КлиентыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Клиенты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Партнер = ТекущиеДанные.Партнер;
	
	Если ЗначениеЗаполнено(Партнер) Тогда
		ПоказатьЗначение(, Партнер);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьЗаказы(Команда)
	ЗаполнитьСписокЗаказов();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗаказыВ2В(Команда)
	ЗагрузитьНовыеЗаказы();
	ЗаполнитьСписокЗаказов();
КонецПроцедуры

&НаКлиенте
Процедура Статус_ВОжидании(Команда)
	ТекущиеДанные = Элементы.Заказы.ТекущиеДанные;
	УстановитьСтатусЗаказа(ТекущиеДанные.Id, ПредопределенноеЗначение("Перечисление.AMS_СтатусыВ2В.pending"));
	ЗаполнитьСписокЗаказов();
КонецПроцедуры

&НаКлиенте
Процедура Статус_ВОбработке(Команда)
	ТекущиеДанные = Элементы.Заказы.ТекущиеДанные;
	УстановитьСтатусЗаказа(ТекущиеДанные.Id, ПредопределенноеЗначение("Перечисление.AMS_СтатусыВ2В.processing"));
	ЗаполнитьСписокЗаказов();
КонецПроцедуры

&НаКлиенте
Процедура Статус_Подтрержден(Команда)
	ТекущиеДанные = Элементы.Заказы.ТекущиеДанные;
	УстановитьСтатусЗаказа(ТекущиеДанные.Id, ПредопределенноеЗначение("Перечисление.AMS_СтатусыВ2В.confirmedClient"));
	ЗаполнитьСписокЗаказов();
КонецПроцедуры

&НаКлиенте
Процедура Статус_Собирается(Команда)
	ТекущиеДанные = Элементы.Заказы.ТекущиеДанные;
	УстановитьСтатусЗаказа(ТекущиеДанные.Id, ПредопределенноеЗначение("Перечисление.AMS_СтатусыВ2В.packed"));
	ЗаполнитьСписокЗаказов();
КонецПроцедуры

&НаКлиенте
Процедура Статус_ГотовКОтгрузке(Команда)
	ТекущиеДанные = Элементы.Заказы.ТекущиеДанные;
	УстановитьСтатусЗаказа(ТекущиеДанные.Id, ПредопределенноеЗначение("Перечисление.AMS_СтатусыВ2В.readyTogo"));
	ЗаполнитьСписокЗаказов();
КонецПроцедуры

&НаКлиенте
Процедура Статус_Отправлен(Команда)
	ТекущиеДанные = Элементы.Заказы.ТекущиеДанные;
	УстановитьСтатусЗаказа(ТекущиеДанные.Id, ПредопределенноеЗначение("Перечисление.AMS_СтатусыВ2В.shipped"));
	ЗаполнитьСписокЗаказов();
КонецПроцедуры

&НаКлиенте
Процедура Статус_Завершен(Команда)
	ТекущиеДанные = Элементы.Заказы.ТекущиеДанные;
	УстановитьСтатусЗаказа(ТекущиеДанные.Id, ПредопределенноеЗначение("Перечисление.AMS_СтатусыВ2В.closed"));
	ЗаполнитьСписокЗаказов();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКлиенты(Команда)
	ЗаполнитьСписокКлиентов();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЦеныКлиента(Команда)
	ТекущиеДанные = Элементы.Клиенты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Id) Тогда
		ТекстОшибки = НСтр("ru = 'Не заполнено поле ""Id""'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ПравилоПродаж) Тогда
		ТекстОшибки = НСтр("ru = 'Не заполнено поле ""Правило продаж""'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Соглашение) Тогда
		ТекстОшибки = НСтр("ru = 'Не заполнено поле ""Соглашение""'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ВыгрузитьЦеныКлиентаНаВ2В(ТекущиеДанные.id, ТекущиеДанные.Соглашение);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЦеныВсемКлиентам(Команда)
	Для Каждого Стр Из Объект.Клиенты Цикл
		Если Не Стр.Id = 0 И ЗначениеЗаполнено(Стр.Соглашение) Тогда
			ВыгрузитьЦеныКлиентаНаВ2В(Стр.id, Стр.Соглашение);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦеныКлиента(Команда)
	СформироватьПрайсЛистКлиентаВ2В(ПолучитьДанныеКлиентаДляПрайса());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокЗаказов()
	Коннектор = РеквизитФормыВЗначение("Объект");
	Коннектор.ПолучитьЗаказы();
	ЗначениеВДанныеФормы(Коннектор, Объект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокКлиентов()
	Коннектор = РеквизитФормыВЗначение("Объект");
	Коннектор.ПолучитьКлиентов();
	ЗначениеВДанныеФормы(Коннектор, Объект);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНовыеЗаказы()
	AMS_Сервер.ЗагрузитьЗаказыВОжиданииРегламентноеЗадание(Объект.ТокенАвторизации);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусЗаказа(Идентификатор, Статус)
	ТекущиеДанные = Элементы.Заказы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	УстановитьСтатусЗаказаНаСервере(ТекущиеДанные.ЗаказКлиента, Идентификатор, Статус);
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусЗаказаНаСервере(ЗаказКлиента, Идентификатор, Статус)
	Если ЗначениеЗаполнено(ЗаказКлиента) Тогда
		AMS_Сервер.ОбновитьЗаказКлиентаНаВ2В(ЗаказКлиента, Статус, Объект.ТокенАвторизации);
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Для заказа Id:" + Идентификатор + " статус необходимо изменить на ""В2В CAFE""");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьЦеныКлиентаНаВ2В(Код, Соглашение)
	Коннектор = РеквизитФормыВЗначение("Объект");
	Коннектор.ВыгрузитьЦеныКлиентаНаВ2В(Код, Соглашение);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеКлиентаДляПрайса()
	ТекСтр = Элементы.Клиенты.ТекущиеДанные;
	
	Если ТекСтр = Неопределено Тогда
		Возврат Неопределено;
	
	Иначе
		Стр = Новый Структура();
		Стр.Вставить("Id", ТекСтр.Id);
		Стр.Вставить("Партнер", ТекСтр.Партнер);
		Стр.Вставить("Соглашение", ТекСтр.Соглашение);
		
		Возврат Стр;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура СформироватьПрайсЛистКлиентаВ2В(Стр)
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Стр.Id = 0 Тогда
		Возврат;
	КонецЕсли;

	ДатаЦены = Константы._ДатаПрайса.Получить();
	
	Стр.Вставить("ДатаЦены", ДатаЦены);
	
	Коннектор = РеквизитФормыВЗначение("Объект");
	
	Рез = Коннектор.ПолучитьДанныеПрайсаКлиентаВ2В(Стр);

	НомерСтроки = 0;

	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ЦеныКлиентаНаВ2В");

	ОблТипПродукции        = Макет.ПолучитьОбласть("ТипПродукции");
	ОблНазначениеПродукции = Макет.ПолучитьОбласть("НазначениеПродукции");
	ОблТоварныйЗнак        = Макет.ПолучитьОбласть("ТоварныйЗнак");
	ОблШапка               = Макет.ПолучитьОбласть("Шапка");
	ОблТовар               = Макет.ПолучитьОбласть("Товар");

	ТабДокПрайсВ2В.Очистить();

	ТабДокПрайсВ2В.НачатьАвтогруппировкуСтрок();

	ТабДокПрайсВ2В.Вывести(ОблШапка);

	Выб1 = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выб1.Следующий() Цикл
		ОблТипПродукции.Параметры.Заполнить(Выб1);
		ТабДокПрайсВ2В.Вывести(ОблТипПродукции, 1, "Тип", Истина);

		Выб2 = Выб1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выб2.Следующий() Цикл
			ОблНазначениеПродукции.Параметры.Заполнить(Выб2);
			ТабДокПрайсВ2В.Вывести(ОблНазначениеПродукции, 2, "Назанчение", Истина);

			Выб3 = Выб2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выб3.Следующий() Цикл
				ОблТоварныйЗнак.Параметры.Заполнить(Выб3);
				ТабДокПрайсВ2В.Вывести(ОблТоварныйЗнак, 3, "Знак", Истина);

				Выб4 = Выб3.Выбрать();
				Пока Выб4.Следующий() Цикл
					НомерСтроки = НомерСтроки + 1;

					ОблТовар.Параметры.Заполнить(Выб4);

					ОблТовар.Параметры.НомерСтроки = НомерСтроки;

					ТабДокПрайсВ2В.Вывести(ОблТовар, 4, "Строка", Истина);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	ТабДокПрайсВ2В.ЗакончитьАвтогруппировкуСтрок();

	ТабДокПрайсВ2В.ФиксацияСверху = 12;

	ОтформатироватьТабДок(ТабДокПрайсВ2В, 9);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтформатироватьТабДок(ТабДок, НомерКолонки = Неопределено)
	Если НомерКолонки = Неопределено Тогда
		НомерКолонки = 7;
	КонецЕсли;

	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	
	Цена0    = Неопределено; Цена1   = Неопределено;
	Верх     = 0;            Низ     = 0;
	ВерхЕсть = Ложь;         НизЕсть = Ложь;
	
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		Ячейка0 = ТабДок.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
		Ячейка1 = ТабДок.Область(НомерСтроки + 1, НомерКолонки, НомерСтроки + 1, НомерКолонки);
		
		Если Ячейка0.СодержитЗначение Тогда
			Цена0 = Ячейка0.Значение;
		Иначе
			Цена0    = Неопределено;
			ВерхЕсть = Ложь; НизЕсть  = Ложь;
			Продолжить;
		КонецЕсли;
		
		Если Ячейка1.СодержитЗначение Тогда
			Цена1 = Ячейка1.Значение;
		Иначе			
			Цена1    = Неопределено;
		КонецЕсли;

		Если Цена0 = Цена1 Тогда
			Если Не ВерхЕсть Тогда
				ВерхЕсть = Истина;
				Верх     = Ячейка0.Верх;
			КонецЕсли;
		Иначе	
			Если ВерхЕсть Тогда
				НизЕсть  = Истина;
				Низ      = Ячейка0.Низ;
			КонецЕсли;
		КонецЕсли;
			
		Если ВерхЕсть И НизЕсть Тогда
			ВерхЕсть = Ложь;
			НизЕсть  = Ложь;
			
			Область = ТабДок.Область(Верх, 5, Низ, 5);
			Область.Объединить();
			
			Область = ТабДок.Область(Верх, 6, Низ, 6);
			Область.Объединить();
			
			Область = ТабДок.Область(Верх, 7, Низ, 7);
			Область.Объединить();
			
			Область = ТабДок.Область(Верх, 8, Низ, 8);
			Область.Объединить();
			
			Область = ТабДок.Область(Верх, 9, Низ, 9);
			Область.Объединить();
			
			Область = ТабДок.Область(Верх, 10, Низ, 10);
			Область.Объединить();
			
			Область = ТабДок.Область(Верх, 11, Низ, 11);
			Область.Объединить();

			Область = ТабДок.Область(Верх, 12, Низ, 12);
			Область.Объединить();

			Область = ТабДок.Область(Верх, 13, Низ, 13);
			Область.Объединить();

			Область = ТабДок.Область(Верх, 14, Низ, 14);
			Область.Объединить();

			Область = ТабДок.Область(Верх, 15, Низ, 15);
			Область.Объединить();

			Область = ТабДок.Область(Верх, 16, Низ, 16);
			Область.Объединить();

			Область = ТабДок.Область(Верх, 17, Низ, 17);
			Область.Объединить();

			Область = ТабДок.Область(Верх, 18, Низ, 18);
			Область.Объединить();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
